'''
Задача 11
Выведите первый и последний элемент списка.
'''

a = "ksdjfklsdjfsejflkwel;f"
li = list(a)
print(li[0])
print(li[-1])