'''
Задача 18
Посчитайте, сколько раз символ встречается в строке.
'''

st = 'sd,fmsldfm;lsflw,e;f,sd,f;le;f,d.,fmskrnntnrjirejojre'
print(st.count('s'))